Import SQLAlchemy & PyMySql 
Use Sqlalchemy to connect to the mysql server and create an engine
Print table names

In [1]:
#Import packages sqlalchemy, pymysql & pandas
#create the engine in sqlaclhemy with connecting to the loacl host & database

from sqlalchemy import create_engine
import pymysql
import pandas as pd
engine = create_engine('mysql+pymysql://userb:passwordb@localhost/country_club')
print(engine.table_names())

['bookings', 'facilities', 'members']

Bookings Table

In [2]:

with engine.connect() as con: #create the context manager for connecting to the engine
    rs = con.execute("SELECT * FROM bookings;") #execute the SQL statement
    df = pd.DataFrame(rs.fetchmany(size = 10)) #insert the result to a Dataframe table with pandas
    df.columns = rs.keys() #set the col labels as the rs keys
df

   bookid  facid  memid            starttime  slots
0       0      3      1  2012-07-03 11:00:00      2
1       1      4      1  2012-07-03 08:00:00      2
2       2      6      0  2012-07-03 18:00:00      2
3       3      7      1  2012-07-03 19:00:00      2
4       4      8      1  2012-07-03 10:00:00      1
5       5      8      1  2012-07-03 15:00:00      1
6       6      0      2  2012-07-04 09:00:00      3
7       7      0      2  2012-07-04 15:00:00      3
8       8      4      3  2012-07-04 13:30:00      2
9       9      4      0  2012-07-04 15:00:00      2

Facilities Table

In [3]:
with engine.connect() as con:
    rs = con.execute("SELECT * FROM facilities;")
    fac_df = pd.DataFrame(rs.fetchmany(size = 5))
    fac_df.columns = rs.keys()
fac_df

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000,200
1,1,Tennis Court 2,5.0,25.0,8000,200
2,2,Badminton Court,0.0,15.5,4000,50
3,3,Table Tennis,0.0,5.0,320,10
4,4,Massage Room 1,9.9,80.0,4000,3000

Members Table

In [4]:
with engine.connect() as con:
    rs = con.execute("SELECT * FROM members;")
    mem_df = pd.DataFrame(rs.fetchmany(size = 5))
    mem_df.columns = rs.keys()
mem_df

,memid,surname,firstname,address,zipcode,telephone,recommendedby,joindate
0,0,GUEST,GUEST,GUEST,0,(000) 000-0000,,2012-07-01 00:00:00
1,1,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05
2,2,Smith,Tracy,"8 Bloomsbury Close, New York",4321,555-555-5555,,2012-07-02 12:08:23
3,3,Rownam,Tim,"23 Highway Way, Boston",23423,(844) 693-0723,,2012-07-03 09:32:15
4,4,Joplette,Janice,"20 Crossing Road, New York",234,(833) 942-4710,1,2012-07-03 10:25:05

/* Q1: Some of the facilities charge a fee to members, but some do not.
Please list the names of the facilities that do. */

In [5]:
with engine.connect() as con:
    rs = con.execute("SELECT * FROM facilities WHERE membercost > 0;") # Select all facilities columns, Filter for rows where the membercost is more than $0
    fac_df = pd.DataFrame(rs.fetchall())
    fac_df.columns = rs.keys()
fac_df

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000,200
1,1,Tennis Court 2,5.0,25.0,8000,200
2,4,Massage Room 1,9.9,80.0,4000,3000
3,5,Massage Room 2,9.9,80.0,4000,3000
4,6,Squash Court,3.5,17.5,5000,80

/* Q2: How many facilities do not charge a fee to members? */

In [6]:
#Use aggregate function Count on 'name' column, name column 'free facilities'
#Select (Filter) facilities that charge no cost ( = to 0)
with engine.connect() as con:
    rs = con.execute("SELECT COUNT(name) AS Free_Facilities \
                      FROM facilities WHERE membercost = 0;") 
    fac_df = pd.DataFrame(rs.fetchall())
    fac_df.columns = rs.keys()
fac_df

   Free_Facilities
0                4


/* Q3: How can you produce a list of facilities that charge a fee to members,
where the fee is less than 20% of the facility's monthly maintenance cost?
Return the facid, facility name, member cost, and monthly maintenance of the
facilities in question. */

In [7]:
# select columns - facid, name, member cost & monthly 
#maintenance from the Facilities table
#Use Where to filter. Select only stores that are less
#than 20% the monthly maintenance cost
# Order by membercost

sql = ("SELECT facid,\
name,\
membercost,\
monthlymaintenance \
FROM facilities \
WHERE membercost < (monthlymaintenance * .2) \
ORDER BY 3;")

with engine.connect() as con:
    rs = con.execute(sql) 
    fac_df = pd.DataFrame(rs.fetchall())
    fac_df.columns = rs.keys()
fac_df

   facid             name membercost  monthlymaintenance
0      2  Badminton Court        0.0                  50
1      3     Table Tennis        0.0                  10
2      7    Snooker Table        0.0                  15
3      8       Pool Table        0.0                  15
4      6     Squash Court        3.5                  80
5      0   Tennis Court 1        5.0                 200
6      1   Tennis Court 2        5.0                 200
7      4   Massage Room 1        9.9                3000
8      5   Massage Room 2        9.9                3000


/* Q4: How can you retrieve the details of facilities with ID 1 and 5?
Write the query without using the OR operator. */

In [8]:
#use the LIKE operator with the % before the 2 to signify 'ending with 2'
#becasue the code is written in python it is interpreting 
#the % as a printif-like format character, so needed to add an extra % symbol
with engine.connect() as con:
    rs = con.execute("SELECT * FROM facilities WHERE name LIKE '%%2' ;") 
    fac_df = pd.DataFrame(rs.fetchall())
    fac_df.columns = rs.keys()
fac_df

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,1,Tennis Court 2,5.0,25.0,8000,200
1,5,Massage Room 2,9.9,80.0,4000,3000


/* Q5: How can you produce a list of facilities, with each labelled as
'cheap' or 'expensive', depending on if their monthly maintenance cost is
more than $100? Return the name and monthly maintenance of the facilities
in question. */

In [9]:
#use CASE with monthly maintenance as >100 as the first condition 'expensive',
#else cheap if it does not meet the condition
#placed  in a column named 'cost'

sql = "SELECT name,\
monthlymaintenance, \
CASE WHEN monthlymaintenance >100 THEN 'expensive'\
      ELSE 'cheap' END AS Cost \
FROM facilities ;"

with engine.connect() as con:
    rs = con.execute(sql) 
    fac_df = pd.DataFrame(rs.fetchall())
    fac_df.columns = rs.keys()
fac_df

              name  monthlymaintenance       Cost
0   Tennis Court 1                 200  expensive
1   Tennis Court 2                 200  expensive
2  Badminton Court                  50      cheap
3     Table Tennis                  10      cheap
4   Massage Room 1                3000  expensive
5   Massage Room 2                3000  expensive
6     Squash Court                  80      cheap
7    Snooker Table                  15      cheap
8       Pool Table                  15      cheap


/* Q6: You'd like to get the first and last name of the last member(s)
who signed up. Do not use the LIMIT clause for your solution. */

In [10]:
sql = ("SELECT firstname \
         , surname\
        FROM members\
        WHERE joindate = (SELECT MAX(joindate)\
                          FROM members)")

with engine.connect() as con:
    rs = con.execute(sql)
    mem_df = pd.DataFrame(rs.fetchall())
    mem_df.columns = rs.keys()
mem_df

  firstname surname
0    Darren   Smith

/* Q7: How can you produce a list of all members who have used a tennis court?
Include in your output the name of the court, and the name of the member
formatted as a single column. Ensure no duplicate data, and order by
the member name. */

In [11]:
#Used Concat with Distint with the member name from the members table 
# to get the unique combinations of member & factilitiy
#I concat this with the name of the 
#facility from the facilities table
#joined the bookings & Members table on memid
#joined the facililities table with the bookings table on the facility id
#filtered the facility name column to match strings that start with 'Tennis Court'
#ordered by the column

sql = "SELECT DISTINCT CONCAT(m.firstname, ' ', m.surname) AS membername, \
              f.name AS facility \
FROM bookings b \
JOIN members m \
ON m.memid = b.memid \
JOIN facilities f \
ON f.facid = b.facid \
WHERE f.name LIKE 'Tennis Court%%' \
ORDER BY 1"

with engine.connect() as con:
    rs = con.execute(sql)
    db = pd.DataFrame(rs.fetchall())
    db.columns = rs.keys()
db

           membername        facility
0          Anne Baker  Tennis Court 1
1          Anne Baker  Tennis Court 2
2        Burton Tracy  Tennis Court 2
3        Burton Tracy  Tennis Court 1
4        Charles Owen  Tennis Court 1
5        Charles Owen  Tennis Court 2
6        Darren Smith  Tennis Court 2
7       David Farrell  Tennis Court 2
8       David Farrell  Tennis Court 1
9         David Jones  Tennis Court 2
10        David Jones  Tennis Court 1
11       David Pinker  Tennis Court 1
12      Douglas Jones  Tennis Court 1
13      Erica Crumpet  Tennis Court 1
14     Florence Bader  Tennis Court 2
15     Florence Bader  Tennis Court 1
16     Gerald Butters  Tennis Court 2
17     Gerald Butters  Tennis Court 1
18        GUEST GUEST  Tennis Court 2
19        GUEST GUEST  Tennis Court 1
20   Henrietta Rumney  Tennis Court 2
21         Jack Smith  Tennis Court 2
22         Jack Smith  Tennis Court 1
23    Janice Joplette  Tennis Court 1
24    Janice Joplette  Tennis Court 2
25     Jemima Farrell  Tennis Court 1
26     Jemima Farrell  Tennis Court 2
27        Joan Coplin  Tennis Court 1
28          John Hunt  Tennis Court 1
29          John Hunt  Tennis Court 2
30    Matthew Genting  Tennis Court 1
31  Millicent Purview  Tennis Court 2
32         Nancy Dare  Tennis Court 2
33         Nancy Dare  Tennis Court 1
34    Ponder Stibbons  Tennis Court 2
35    Ponder Stibbons  Tennis Court 1
36   Ramnaresh Sarwin  Tennis Court 1
37   Ramnaresh Sarwin  Tennis Court 2
38         Tim Boothe  Tennis Court 2
39         Tim Boothe  Tennis Court 1
40         Tim Rownam  Tennis Court 2
41         Tim Rownam  Tennis Court 1
42      Timothy Baker  Tennis Court 2
43      Timothy Baker  Tennis Court 1
44        Tracy Smith  Tennis Court 2
45        Tracy Smith  Tennis Court 1

/* Q8: How can you produce a list of bookings on the day of 2012-09-14 which
will cost the member (or guest) more than $30? Remember that guests have
different costs to members (the listed costs are per half-hour 'slot'), and
the guest user's ID is always 0. Include in your output the name of the
facility, the name of the member formatted as a single column, and the cost.
Order by descending cost, and do not use any subqueries. */

In [12]:
#Concat the first & last name columns and place as column membername
#add name of the facility from the facility table
#Use Case - if the member id in booking is > 0 then multiply slots (session) by the member cost
#else if the mem id is 0,  multiply slots by guest cost and name the column Cost
#join bookings table with members table on member id column
#join the facilities columns with the bookings column on the faclitiy id col
#filter for only the day of 09/04/2012 - need to use an additional '%' due to python
#Add the CASE statement to the Where claus and filter for instances > 30
#Order descending by the Cost
sql = "SELECT \
CONCAT(m.firstname, ' ' , m.surname) AS membername, \
f.name, \
CASE WHEN b.memid >0 THEN b.slots * f.membercost \
     ELSE b.slots * f.guestcost END AS Cost \
FROM bookings b \
JOIN members m \
ON b.memid = m.memid \
JOIN facilities f \
ON f.facid = b.facid \
WHERE b.starttime LIKE '2012-09-04%%' \
AND CASE WHEN b.memid >0 THEN b.slots * f.membercost \
     ELSE b.slots * f.guestcost END >30 \
ORDER BY 3 DESC"
with engine.connect() as con:
    rs = con.execute(sql)
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()
df

     membername             name   Cost
0   GUEST GUEST   Massage Room 2  160.0
1   GUEST GUEST   Massage Room 2  160.0
2   GUEST GUEST   Massage Room 1  160.0
3   GUEST GUEST   Massage Room 1  160.0
4   GUEST GUEST   Massage Room 1  160.0
5   GUEST GUEST   Massage Room 1  160.0
6   GUEST GUEST   Massage Room 1  160.0
7   GUEST GUEST   Tennis Court 2   75.0
8   GUEST GUEST   Tennis Court 1   75.0
9   GUEST GUEST   Tennis Court 1   75.0
10  GUEST GUEST   Tennis Court 1   75.0
11  GUEST GUEST   Tennis Court 2   75.0
12  GUEST GUEST   Tennis Court 2   75.0
13  GUEST GUEST     Squash Court   70.0
14  GUEST GUEST  Badminton Court   46.5
15  GUEST GUEST  Badminton Court   46.5
16  GUEST GUEST     Squash Court   35.0
17  GUEST GUEST     Squash Court   35.0


/* Q9: This time, produce the same result as in Q8, but using a subquery. */

In [13]:
#Same as above - difference was to add the above statement
#ommitting the CASE statement in the WHERE clause
# Then starting a new SELECT statement, selecting all columns
#and placing the whole statement above inside the FROM statement, selecting all the columns
#assign the table created 'tmp'
#Add a WHERE statement on the outside SELECT statement selecting instances of Cost >30
sql = "SELECT * \
FROM \
  (SELECT CONCAT( m.firstname,  ' ', m.surname ) AS membername, f.name,  \
  CASE  \
     WHEN b.memid >0 AND ((b.slots * f.membercost) >30) THEN b.slots * f.membercost \
     WHEN b.memid =0 AND ((b.slots * f.guestcost) >30)  THEN b.slots * f.guestcost \
     ELSE NULL END AS Cost \
  FROM Bookings b \
  JOIN Members m ON b.memid = m.memid \
  JOIN Facilities f ON f.facid = b.facid \
  WHERE b.starttime LIKE  '2012-09-04%%') tmp \
WHERE Cost > 30 \
ORDER BY Cost DESC"
with engine.connect() as con:
    rs = con.execute(sql)
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()
df

     membername             name   Cost
0   GUEST GUEST   Massage Room 2  160.0
1   GUEST GUEST   Massage Room 2  160.0
2   GUEST GUEST   Massage Room 1  160.0
3   GUEST GUEST   Massage Room 1  160.0
4   GUEST GUEST   Massage Room 1  160.0
5   GUEST GUEST   Massage Room 1  160.0
6   GUEST GUEST   Massage Room 1  160.0
7   GUEST GUEST   Tennis Court 2   75.0
8   GUEST GUEST   Tennis Court 1   75.0
9   GUEST GUEST   Tennis Court 1   75.0
10  GUEST GUEST   Tennis Court 1   75.0
11  GUEST GUEST   Tennis Court 2   75.0
12  GUEST GUEST   Tennis Court 2   75.0
13  GUEST GUEST     Squash Court   70.0
14  GUEST GUEST  Badminton Court   46.5
15  GUEST GUEST  Badminton Court   46.5
16  GUEST GUEST     Squash Court   35.0
17  GUEST GUEST     Squash Court   35.0

/* Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members! */

In [14]:
#Created a sub Qurery of the Facilities and Bookings tables
# used Sum aggregate with the CASE statement to calculate members * guests costs
#placed this in a column labeled 'ttl_revenue'
#In the outer query, took the table and filtered for rows that were <1000
#then ordered by ttl_revenue

sql = "SELECT name, ttl_revenue \
FROM \
      (SELECT f.name, \
         SUM(CASE WHEN b.memid > 0 then f.membercost * b.slots \
                   ELSE f.guestcost * b.slots END) AS ttl_revenue \
       FROM bookings b \
       JOIN facilities f \
       ON b.facid = f.facid \
       GROUP BY f.name) tmp \
WHERE ttl_revenue < 1000 \
ORDER BY 2"

with engine.connect() as con:
    rs = con.execute(sql)
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()
df

            name ttl_revenue
0   Table Tennis       180.0
1  Snooker Table       240.0
2     Pool Table       270.0